/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   vec3_add_sub.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: akreise <akreise@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/12 14:14:48 by pshcherb          #+#    #+#             */
/*   Updated: 2025/07/19 19:50:13 by akreise          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/math_utils.h"

t_vec3	vec3_add(t_vec3 a, t_vec3 b)// Сложение двух векторов
{
	// Складываем соответствующие координаты: x, y и z
	// Возвращаем новый вектор
	return ((t_vec3){
		a.x + b.x,
		a.y + b.y,
		a.z + b.z
	});
} //Если a = {1, 2, 3} и b = {4, 5, 6}, то результат будет {5, 7, 9}.

t_vec3	vec3_sub(t_vec3 a, t_vec3 b)// Вычитание двух векторов
{
	// Вычитаем соответствующие координаты: x, y и z
	// Возвращаем новый вектор
	return ((t_vec3){
		a.x - b.x,
		a.y - b.y,
		a.z - b.z
	});
}//Если a = {4, 5, 6} и b = {1, 2, 3}, то результат будет {3, 3, 3}.
