/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   vec3_dot_cross.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: akreise <akreise@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/12 14:25:42 by pshcherb          #+#    #+#             */
/*   Updated: 2025/07/20 18:47:37 by akreise          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/math_utils.h"

//скалярное произведение - насколько два вектора направлены в одном направлении. 
//Если результат > 0 — угол между векторами острый.
//Если результат < 0 — угол тупой.
//Если результат = 0 — векторы перпендикулярны.
double	vec3_dot(t_vec3 a, t_vec3 b)
{
	// Вычисляется по формуле: a·b = ax·bx + ay·by + az·bz
	// Результат — одно число (double)
	return (a.x * b.x + a.y * b.y + a.z * b.z);
}

//векторное произведение - Результат — новый вектор, перпендикулярный к обоим исходным
t_vec3	vec3_cross(t_vec3 a, t_vec3 b)
{
	// Вычисляется по формуле:
	// x = ay*bz - az*by
	// y = az*bx - ax*bz
	// z = ax*by - ay*bx
	return ((t_vec3){
		a.y * b.z - a.z * b.y,
		a.z * b.x - a.x * b.z,
		a.x * b.y - a.y * b.x
	});
}
